20240219T225359--kdoc-100-細かいことを気にせず進める__essay.org
:properties:
:ID: 20240219T225359
:end:
#+title:      KDOC 100: 細かいことを気にせず進める
#+date:       [2024-02-19 Mon 22:53]
#+filetags:   :essay:
#+identifier: 20240219T225359

* この文書のステータス
- 作成
  - [X] 2024-02-19 貴島
- レビュー
  - [X] 2024-02-25 貴島
* 概要
細かいことを気にせず前へ進めることが、ものごとを続けるコツなのでは、と考えた。

以前[[id:20230301T234645][KDOC 21: 仕事のように集中する]]で、仕事は他者への責任意識や時間の制約があるから集中でき、プライベートではそれがないからなかなか進まないのではないか、と考えた。しかし最近思ったのは、無理やり進まされるのが良いのでは、ということだ。仕事ではどうしても解決できない問題があったとき、妥協して醜い解決法をとったりする。そうして強制的に進められる。しばらくしたあとにパッと解決できたりできなかったりする。常に何かしら進んでいて、新しい問題に取り組んでいる。完全に止まることはない。もし、仕事でうまくいかない1つの問題へ永遠に取り組まされたら、すぐ参ってしまうだろう。

一方でプライベートではどうだろう。何か1つ壁に突き当たったら、それで嫌になって途中でやめてしまう率が高い。完璧主義な傾向が強くなるようだ[fn:1]。

だから、とりあえず前に進めてあとから直そう、自分へ言い聞かせることにした。悪魔の囁きなときもあるが、何も進まないよりはマシだ。自信を持って未来の自分に託そう。途中でやめてしまうのが一番の損失だと思い出そう。

* 関連
- [[id:20230301T234645][KDOC 21: 仕事のように集中する]]。ここでの意見を修正した
- [[id:20230105T205739][KDOC 17: 社外の人と開発するコツ]]。関係性を築いてしまうと、それほどプレッシャーはなくなった。それでも仕事での開発はうまく進んでいるように見えるので、考え直すことにした
* Footnotes
[fn:1] 完全主義とはほど遠い生活を送っているにも関わらず。
