20240219T225359--kdoc-100-細かいことを気にせず進める__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-11T23:12:12Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 100: 細かいことを気にせず進める</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 100: 細かいことを気にせず進める</h1>
<div id="outline-container-org79401b7" class="outline-2">
<h2 id="org79401b7"><a href="#org79401b7">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org79401b7">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-19 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-25 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org92ee5aa" class="outline-2">
<h2 id="org92ee5aa"><a href="#org92ee5aa">概要</a></h2>
<div class="outline-text-2" id="text-org92ee5aa">
<p>
細かいことを気にせず前へ進めることが、ものごとを続けるコツなのでは、と考えた。
</p>

<p>
以前<a href="20230301T234645--kdoc-21-仕事のように集中する__essay.html#ID-20230301T234645">KDOC 21: 仕事のように集中する</a>で、仕事は他者への責任意識や時間の制約があるから集中でき、プライベートではそれがないからなかなか進まないのではないか、と考えた。しかし最近思ったのは、無理やり進まされるのが良いのでは、ということだ。仕事ではどうしても解決できない問題があったとき、妥協して醜い解決法をとったりする。そうして強制的に進められる。しばらくしたあとにパッと解決できたりできなかったりする。常に何かしら進んでいて、新しい問題に取り組んでいる。完全に止まることはない。もし、仕事でうまくいかない1つの問題へ永遠に取り組まされたら、すぐ参ってしまうだろう。
</p>

<p>
一方でプライベートではどうだろう。何か1つ壁に突き当たったら、それで嫌になって途中でやめてしまう率が高い。完璧主義な傾向が強くなるようだ<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>。
</p>

<p>
だから、とりあえず前に進めてあとから直そう、自分へ言い聞かせることにした。悪魔の囁きなときもあるが、何も進まないよりはマシだ。自信を持って未来の自分に託そう。途中でやめてしまうのが一番の損失だと思い出そう。
</p>
</div>
</div>
<div id="outline-container-org760b624" class="outline-2">
<h2 id="org760b624"><a href="#org760b624">関連</a></h2>
<div class="outline-text-2" id="text-org760b624">
<ul class="org-ul">
<li><a href="20230301T234645--kdoc-21-仕事のように集中する__essay.html#ID-20230301T234645">KDOC 21: 仕事のように集中する</a>。ここでの意見を修正した</li>
<li><a href="20230105T205739--kdoc-17-社外の人と開発するコツを考える__essay.html#ID-20230105T205739">KDOC 17: 社外の人と開発するコツを考える</a>。関係性を築いてしまうと、それほどプレッシャーはなくなった。それでも仕事での開発はうまく進んでいるように見えるので、考え直すことにした</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
完全主義とはほど遠い生活を送っているにも関わらず。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
